<template>
  <div class="agreementDiv">
    <div class="agreementCon">
      <div class="title">用户使用条款协议</div>
      <p>
        请在访问和使用本系统前仔细阅读以下用户使用协议(以下简称“协议")的条款(以下简称“条款"或“本条款")。一旦您访问或使用本系统，即说明您已同意受本条款的约束并遵守本条款。小白在线保留在其认为需要时对本条款进行修改的权利。我们也将随时在本系统上公布对本协议相关修改。
      </p>
      <p>
        服务说明：本系统内容涉及研究、文章、幻灯片、图文、工具、培训材料以及其他资源。本系统所载信息只为在中华人民共和国正式取得执业资格的医疗卫生专业人员所提供。本系统所载信息仅供您参考绝无意代替您自己的医学判断并且本系统刊载的评论和其他内容亦无意作为可以依赖的建议。因此，本系统郑重声明因任何本系统访问者或任何获知本系统内容者基于对本系统材料的依赖所引起的任何行为的责任与义务都与本系统无关，本系统概不负责，亦不负任何法律责。本系统登载或者转载的文章仅代表作者个人观点，与本系统立场无关。其原创性以及文中陈述文字和内容未经本系统核实，对本文以及其中全部或者部分内容、文字的真实性、完整性、及时性本站不作任何保证或承诺，请您仅作参考，并请自行核实相关内容。作为一位医疗卫生专业人士，您应该通过您自己的专业判断来评估本系统所提供的所有信息。我们也建议在作出任何评价或治疗决定前请咨询其他专业人士并查阅其他参考资料。
      </p>
      <p>
        上传数据：每当您使用允许您向本系统上传材料的功能或与其他本系统用户联系时(如微信群、论坛)，您必须遵守这些条款及条件。访问者禁止提交、发布、分发或传送任何违反法律法规的内容，包括但不限于《互联网信息服务管理办法》所禁止制作、复制、发布、传播的内容、任何诽谤性(或潜在有诽谤性)、淫秽、攻击性、不雅、侵权或其他非法或令人讨厌或反感的材料或信息、违法广告、侵犯任何第三方知识产权等。您不得向或从本系统发布、转递任何从技术上来说是有害的材料(包括但不限于：电脑病毒、逻辑炸弹、特洛伊木马、蠕虫、有害成分、损坏的数据或其他恶意软件或有害的数据)。任何您所上传到本系统的材料将被视为非机密和非专有的，您授权小白在线及其关联公司可使用、复制和分发任何这类材料用于任何用途。小白在线还有权披露这些信息，以充分配合任何执法机关或法院，如其要求或指示小白在线披露任何违反本条款发布、转递材料的个人的身份或相关信息。小白在线将不对您或本系统任何其他访问者发布、转递的任何材料的内容或准确性负责，也不会就此向任何第三方承担责任。如果我们认为这些材料不符合这些使用条款，我们有权直接删除您在系统上制作或发布的任何材料。
      </p>
      <p>
        第三方内容：对第三方提供的信息或我们提供链接的其他系统的内容，小白在线不承担任何责任。这些互联网系统受其各自系统上所列明的适用于其自身的使用条款的管辖。
      </p>
      <p>
        免责声明：本系统所展示的资料并不附有任何针对其准确性的陈述、条件或担保。在法律允许的范围内，小白在线及其关联公司以及与小白在线有关联关系的第三方就此明确排除适用成文法、普通法或衡平法可能暗指的所有的条件、保证和其他条款，包括但不限于保证质量满意、保证特定用途的适销性、保证使用合理的注意和技能以及保证不侵犯专有权利。
      </p>
      <p>
        责任：对任何因使用本系统或本系统所载信息、内容或资料而造成的或与之相关的任何性质的索赔，损失、要求或赔偿，小白在线不承担责任(无论这种索赔，损失，要求或赔偿是否是可以预见的，已知的或具有其他情形)。虽然小白在线努力确保本系统所提供的内容在发布时是正确的，但小白在线也不对本系统内容的任何错误、疏忽或不准确承担责任。本条款并不排除或限制小白在线针对由小白在线(或其雇员)的故意的过失而造成的死亡或人身伤害而应承担的责任。
      </p>
      <p>
        同意使用相关数据：您同意小白在线或关联公司可以收集和使用有关技术数据和相关信息，包括但不限于您的设备(例如，设备标号)的技术信息，系统和应用软件信息，以及外部设备，这些信息的定期收集将有助于我们为您提供与此“应用程序"软件升级、支持和其他服务。小白在线或其他为小白在线提供服务的公司将使用上述信息进行改进、或是向您提供他们的产品、流程、服务或技术。如您选择向小白在线提供有关信息(例如，使用应用程序提供的信息反馈功能)，小白在线或其他为小白在线提供服务的公司将收集并利用这些信息识别您的身份。小白在线或其他为小白在线提供服务的公司将就用户使用应用程序的情况以及他们的选择偏好收集数据、生成报告(有时候，这亦被称为应用程序分析)。
      </p>
      <p>
        使用：您可以从本系统任何一个页面打印副本，并下载摘要，作为您的个人参考。您不可以以任何方式修改您打印或下载的任何材料的纸质或电子文档，并且您不得将本系统任何插图、照片、视频或音频片段或任何图形与其所附有的文字分离开来单独使用。小白在线(以及任何身份确定的撰稿人)作为本系统材料作者和/或运营者的身份必须始终被注明。您不得将本系统材料中任何内容用于商业营利目的。如果您违反本协议条款，打印、复制、使用或者下载系统任何部分，您使用本系统的权利将立即被终止；并且如我方选择行使该等终止权利，您必须返还或销毁您所制作的材料的任何副本。
      </p>
      <p>
        陈述：作为本系统的访问者，您应负责并确保您向我们提供的信息的准确性。
      </p>
      <p>
        本系统之使用条款协议的修改及更新权均属于小白在线
      </p>
      <div class="btnDiv">
        <van-button plain type="primary" @click="goback" size="small">已阅</van-button>
      </div>

    </div>
  </div>
</template>

<script>
  export default {
    name: "agreement",
    methods: {
      goback() {
        this.$emit('getbackC');
      }
    }
  }
</script>

<style scoped>
  .agreementDiv {
    height: 100vh;
    width: 100vw;
    margin-top: 3vh;
  }

  .agreementCon {
    padding: 0 10px;
  }

  .title {
    text-align: center;
    font-weight: 600;
  }

  .btnDiv{
    text-align: center;
    margin-bottom: 2vh;
  }

</style>
